'They Should Be Ashamed': With Jobless Benefits to Expire in 9 Days, Republicans Pull Out All Stops to Obstruct Relief Bill | "When Sen. Johnson voted to cut taxes for the wealthiest Americans, he didn't force staff to read the bill. But now that working people need help, he's forcing a delay."
What is a song you cannot listen to for an emotional reason?
The magical moment he realizes the hand belongs to friend not foe
WandaVision S01E09 - Discussion Thread
Shade on a street in Jerez, Spain
GME Megathread for March 05, 2021
The ten years between 25 and 35 are far shorter than the four years between 14 and 18.
The United States is now averaging 2 million vaccine doses administered per day.
What it’s like sleeping with a baby
Public hospitals in Norway
Dr. Seuss wasn't "canceled" and the people who claim he was are fearmongering idiots
Picture of my mother in law walking the cows
They could have the house paid off in just 125 years.
LeBron: "There's no slander to the Utah Jazz. You guys got to understand just like with video games growing up, we never played with Utah Jazz. Even as great as Karl Malone and John Stockton was, we never picked those guys ."
Apple tart coming out of the oven, this is a better one than my other photo
[OC] Vision goes brrr
Pupper finds the water a little deeper than expected
LPT: If someone slights/insults you publicly during a meeting, pretend like you didn't hear them the first time and politely ask them to repeat themself. They'll either double-down &amp; repeat the insult again, making them look rude &amp; unprofessional. Or they'll realize their mistake &amp; apologize to you.
A gold mountain was discovered in Eastern DRC (South Kivu), reportedly the soil is 90% gold. Villagers are seen digging it up to bring it to their homes. (It is estimated that DRC contains $25 Trillion US dollars worth of natural resources).
Meme People: Then and Now
One Piece Chapter 1006
Rioter who broke into Pelosi's office: Not 'fair' I'm still in jail
TIL that Ring was on Shark Tank and walked away without a deal. Ring later sold to Amazon for $1 billion.
What it’s like sleeping with a baby
We joke about older people not being able to use technology properly but their generations knew a ton of different skills that we don’t know how to do and would look equally dumb for.
